<a href="https://colab.research.google.com/github/priyanshgupta1998/All_codes/blob/master/decision_tree2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

In [45]:
df = pd.read_csv("/home/titanic_data0.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Now i'm gonna remove 'PassengerId', 'Name',' SibSp',' Parch',' Ticket',' Cabin',' Embarked' columns from the dataset

In [0]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)

In [48]:
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [50]:
print(len(df))
print(df.shape)

891
(891, 5)

Now take out first column as target dataset and let all other colmns be in the traing dataset

In [52]:
inputs = df.drop('Survived',axis='columns')
inputs.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [54]:
target = df.Survived
print(target.head())

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [55]:
print(len(inputs))
print(inputs.shape)

891
(891, 4)

Now convert the female and male text into their correspoding value 2 ,1

In [0]:
inputs.Sex = inputs.Sex.map({'male': 1, 'female': 2})

In [57]:
inputs.head()

   Pclass  Sex   Age     Fare
0       3    1  22.0   7.2500
1       1    2  38.0  71.2833
2       3    2  26.0   7.9250
3       1    2  35.0  53.1000
4       3    1  35.0   8.0500

In [58]:

inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [0]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())    # fill the empty space by taking mean of the whole column values

In [61]:
inputs.Age[:8]

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
6    54.000000
7     2.000000
Name: Age, dtype: float64

In [64]:
sum=0.0
for i in range(len(inputs.Age)):
  sum += inputs.Age[i]
print(sum)

26461.913823529358

In [66]:
l= len(inputs.Age)
l

891

In [67]:
sum/l

29.699117647058763

In [0]:
from sklearn.model_selection import train_test_split

Now split the dataset in the training and test data by using cross_validation technique

In [0]:
x_train, x_test, y_train, y_test = train_test_split(inputs,target,test_size=0.2)

In [71]:
print(len(x_train))
print(len(x_test))

712
179

In [72]:
print(len(y_train))
print(len(y_test))

712
179

#Decision tree 


```
i'll create decision tree classifier constructer/object to classify dataset .
```

In [0]:
from sklearn import tree
model = tree.DecisionTreeClassifier()

In [75]:
model.fit(x_train,y_train)   # train the model

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
            max_features=None, max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, presort=False, random_state=None,
            splitter='best')

  We calculate the score , to get to know that our model  is trained very well .

In [76]:
  model.score(x_test,y_test)     # find out the score of the model   # how much our model is accurate ?

0.7877094972067039

In [78]:
model.score(x_train,y_train)   # use same dataset to check the model score

0.9817415730337079